# VS Code 拡張機能リスト for Homebrew
# このファイルは homebrew/Brewfile から VS Code 拡張機能部分を抽出したものです

# Neovim統合
vscode "asvetliakov.vscode-neovim"

# テーマとアイコン
vscode "atommaterial.a-file-icon-vscode"
vscode "beardedbear.beardedtheme"
vscode "pkief.material-icon-theme"
vscode "thang-nm.catppuccin-perfect-icons"

# Python開発
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"

# Jupyter Notebook
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"

# Web開発
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "batisteo.vscode-django"

# Git管理
vscode "mhutchie.git-graph"

# LaTeX
vscode "james-yu.latex-workshop"

# AI支援
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "openai.chatgpt"

# その他のユーティリティ
vscode "davidanson.vscode-markdownlint"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
