anthropic.claude-code
asvetliakov.vscode-neovim
atommaterial.a-file-icon-vscode
batisteo.vscode-django
beardedbear.beardedtheme
bierner.markdown-mermaid
bradlc.vscode-tailwindcss
christian-kohler.npm-intellisense
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
ecmel.vscode-html-css
editorconfig.editorconfig
esbenp.prettier-vscode
github.copilot
github.copilot-chat
github.vscode-github-actions
golang.go
graphql.vscode-graphql
graphql.vscode-graphql-syntax
gruntfuggly.todo-tree
james-yu.latex-workshop
llvm-vs-code-extensions.lldb-dap
marp-team.marp-vscode
mechatroner.rainbow-csv
mhutchie.git-graph
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-ja
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
pkief.material-icon-theme
prisma.prisma
qwtel.sqlite-viewer
redhat.vscode-yaml
ritwickdey.liveserver
serkonda7.vscode-vba
streetsidesoftware.code-spell-checker
sumneko.lua
swiftlang.swift-vscode
thang-nm.catppuccin-perfect-icons
vue.volar
yzane.markdown-pdf
