brew "zstd"
brew "colima"
brew "docker"
brew "docker-compose"
brew "graphviz"
brew "mysql"
brew "neovim"
brew "nodebrew"
brew "python@3.13"
brew "pipx"
brew "rbenv"
brew "tree"
brew "uv"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-git-prompt"
cask "font-hack-nerd-font"
