brew "zstd"
brew "ccusage"
brew "colima"
brew "docker"
brew "docker-compose"
brew "go"
brew "graphviz"
brew "imagemagick"
brew "mysql"
brew "neovim"
brew "nodebrew"
brew "python@3.13"
brew "pipx"
brew "rbenv"
brew "tree"
brew "uv"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-git-prompt"
cask "font-hack-nerd-font"
vscode "anthropic.claude-code"
vscode "asvetliakov.vscode-neovim"
vscode "atommaterial.a-file-icon-vscode"
vscode "batisteo.vscode-django"
vscode "beardedbear.beardedtheme"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "james-yu.latex-workshop"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "swiftlang.swift-vscode"
vscode "thang-nm.catppuccin-perfect-icons"
vscode "yzane.markdown-pdf"
go "github.com/air-verse/air"
go "github.com/pressly/goose/v3/cmd/goose"
go "golang.org/x/tools/gopls"
go "github.com/sqlc-dev/sqlc/cmd/sqlc"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/swaggo/swag/cmd/swag"
go "github.com/google/wire/cmd/wire"
